* powsup

Small CLI programm to control a Manson® power-supply. See [[https://www.manson.com.hk/storage/media/Documents/7673-3400-0017_20240306_Approved.pdf][their documentation]] for the protocol details.

It should work in GNU/Linux and Windows environments.

If you happen to have a modestly recent Rust installed then `cargo build` should be enough to get you started.

#+begin_src bash :results output
  cargo build --release
#+end_src


#+begin_src bash :results output :exports both
  ./target/release/powsup --help
#+end_src

#+RESULTS:
#+begin_example
Controlling a Manson power-supply via serial connection.

Usage: powsup [OPTIONS] [COMMAND]

Commands:
  list         List serial ports where a power-supply might be connected to
  off          Turn the output off
  on           Turn the output on
  powercycle   Turn the output off and after x milliseconds back on
  status       Get the preset and the actual voltage and current values
  interactive  Run in interactive mode [default]
  help         Print this message or the help of the given subcommand(s)

Options:
  -s, --serial-port <SERIAL_PORT>  The serial port that the power supply is connected to
  -v, --verbose...                 More output per occurrence
  -q, --quiet...                   Less output per occurrence
  -h, --help                       Print help
  -V, --version                    Print version
#+end_example

** Miscellaneous

#+caption: Create a fake serial device for testing
#+begin_src tmux
  socat UDP:127.0.0.1:5001,bind=127.0.0.1:5000 PTY,link=/tmp/ttypowsup,raw,echo=0,waitslave
#+end_src
